Update README files to correct links and improve documentation and use mermaid for diagrams
